{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "htrModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 512, 64], "dtype": "float32", "target_shape": [512, 64, 1]}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [32, 512]}, "name": "reshape_1", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [32, 1, 1024]}, "name": "reshape_2", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 80, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [32, 80]}, "name": "reshape_3", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9208100438117981, "scale": 0.0006583772453607297, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20052243769168854, "scale": 0.0006361930247615365, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -23.89464901194853, "scale": 0.1866769454058479, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 14.657106399536133, "scale": 0.17599413254681756, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8301293253898621, "scale": 0.00154645980573168, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3803454251412083, "scale": 0.0017367371011014078, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.415233478826635, "scale": 0.00296595342019025, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.1360974907875061, "scale": 0.00039368564007329006, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.32716250559862925, "scale": 0.00270382236031925, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7198321791256176, "scale": 0.0053718819337732655, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14682483316636555, "scale": 0.004736284940850501, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2999384667359146, "scale": 0.0025418514130162257, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.34322340278064506, "scale": 0.0027239952601638496, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12045913712651121, "scale": 0.004633043735635047, "original_dtype": "float32"}}, {"name": "conv2d/kernel", "shape": [5, 5, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14824721129501567, "scale": 0.001015391858185039, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11516995925237151, "scale": 0.0005484283773922453, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18774086634318032, "scale": 0.0013804475466410318, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05849474558935446, "scale": 0.0003678914816940532, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15400916922326183, "scale": 0.0012320733537860946, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01541123664116158, "scale": 0.0001085298355011379, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17598332195889715, "scale": 0.001230652601111169, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02935750396082214, "scale": 0.0002598009200072756, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18200684540412007, "scale": 0.0012908286908093621, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0404573455452919, "scale": 0.00021987687796354294, "original_dtype": "float32"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18571817582728817, "scale": 0.0012464307102502562, "original_dtype": "float32"}}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03717306091943208, "scale": 0.0002280555884627735, "original_dtype": "float32"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1640533447265625, "scale": 0.001242828369140625, "original_dtype": "float32"}}, {"name": "conv2d_6/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03635705847512273, "scale": 0.0002258202389759176, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [1024, 80], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0627259572347005, "scale": 0.007814161450255151, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [80], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6178906054619481, "scale": 0.0026071333563795276, "original_dtype": "float32"}}]}]}