{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "htrModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 720, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 720, 64], "dtype": "float32", "target_shape": [720, 64, 1]}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [90, 1024]}, "name": "reshape_1", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [90, 1, 2048]}, "name": "reshape_2", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [90, 80]}, "name": "reshape_3", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9851647019386292, "scale": 0.00013364787195243086, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.024911371973062427, "scale": 9.846392084214399e-05, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -26.180385058533915, "scale": 0.1757072822720397, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 6.110673904418945, "scale": 0.1057411418241613, "original_dtype": "float32"}}]}, {"paths": ["group2-shard1of1.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0204617977142334, "scale": 0.00016973626379873237, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.016082795051967396, "scale": 8.163855356328628e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10500541040126016, "scale": 0.0010825300041367026, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.02284940332174301, "scale": 8.07533223255008e-05, "original_dtype": "float32"}}]}, {"paths": ["group3-shard1of5.bin", "group3-shard2of5.bin", "group3-shard3of5.bin", "group3-shard4of5.bin", "group3-shard5of5.bin"], "weights": [{"name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [1024, 4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10001790459249534, "scale": 0.00078754255584642, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10889920414078469, "scale": 0.0008312916346624786, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.020371584550422782, "scale": 0.004074316910084556, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [1024, 4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08052774036631864, "scale": 0.0007456272256140615, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12450527566320756, "scale": 0.0009881371084381552, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.020362053468239074, "scale": 0.004072410693647815, "original_dtype": "float32"}}]}, {"paths": ["group4-shard1of1.bin"], "weights": [{"name": "conv2d/kernel", "shape": [5, 5, 1, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08058056393090417, "scale": 0.0006013474920216729, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.024163450059645316, "scale": 0.00014915709913361307, "original_dtype": "float32"}}]}, {"paths": ["group5-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [5, 5, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1174238852133938, "scale": 0.0007203919338245018, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.012032729387283326, "scale": 8.35606207450231e-05, "original_dtype": "float32"}}]}, {"paths": ["group6-shard1of1.bin"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0849406971650965, "scale": 0.0006635991966023164, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0026371007365192855, "scale": 2.076457272849831e-05, "original_dtype": "float32"}}]}, {"paths": ["group7-shard1of1.bin"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06957957652561804, "scale": 0.0005154042705601337, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.005796673576183179, "scale": 5.222228447011873e-05, "original_dtype": "float32"}}]}, {"paths": ["group8-shard1of1.bin"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06999386005541858, "scale": 0.0005343042752322029, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.007979575015020137, "scale": 5.999680462421156e-05, "original_dtype": "float32"}}]}, {"paths": ["group9-shard1of1.bin"], "weights": [{"name": "conv2d_5/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.060312084605296454, "scale": 0.0005068242403806425, "original_dtype": "float32"}}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.002238040999965925, "scale": 2.03458272724175e-05, "original_dtype": "float32"}}]}, {"paths": ["group10-shard1of2.bin", "group10-shard2of2.bin"], "weights": [{"name": "conv2d_6/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06017332626324074, "scale": 0.00044905467360627417, "original_dtype": "float32"}}, {"name": "conv2d_6/bias", "shape": [1024], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.004422134160995483, "scale": 4.806667566299438e-05, "original_dtype": "float32"}}]}, {"paths": ["group11-shard1of1.bin"], "weights": [{"name": "conv2d_7/kernel", "shape": [1, 1, 2048, 80], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18704671333817874, "scale": 0.0013554109662186865, "original_dtype": "float32"}}, {"name": "conv2d_7/bias", "shape": [80], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03310549947805246, "scale": 0.00013033661211831678, "original_dtype": "float32"}}]}]}