{"modelTopology":{"class_name":"Model","config":{"name":"htrModel","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,800,64],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"reshape","class_name":"Reshape","config":{"target_shape":[800,64,1],"name":"reshape","trainable":true,"batch_input_shape":[null,800,64],"dtype":"float32"},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"conv2d","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d","trainable":true},"inbound_nodes":[[["reshape",0,0,{}]]]},{"name":"leaky_re_lu","class_name":"LeakyReLU","config":{"alpha":0.009999999776482582,"name":"leaky_re_lu","trainable":true},"inbound_nodes":[[["conv2d",0,0,{}]]]},{"name":"max_pooling2d","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d","trainable":true},"inbound_nodes":[[["leaky_re_lu",0,0,{}]]]},{"name":"conv2d_1","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_1","trainable":true},"inbound_nodes":[[["max_pooling2d",0,0,{}]]]},{"name":"leaky_re_lu_1","class_name":"LeakyReLU","config":{"alpha":0.009999999776482582,"name":"leaky_re_lu_1","trainable":true},"inbound_nodes":[[["conv2d_1",0,0,{}]]]},{"name":"max_pooling2d_1","class_name":"MaxPooling2D","config":{"pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last","name":"max_pooling2d_1","trainable":true},"inbound_nodes":[[["leaky_re_lu_1",0,0,{}]]]},{"name":"conv2d_2","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_2","trainable":true},"inbound_nodes":[[["max_pooling2d_1",0,0,{}]]]},{"name":"batch_normalization","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization","trainable":true},"inbound_nodes":[[["conv2d_2",0,0,{}]]]},{"name":"leaky_re_lu_2","class_name":"LeakyReLU","config":{"alpha":0.009999999776482582,"name":"leaky_re_lu_2","trainable":true},"inbound_nodes":[[["batch_normalization",0,0,{}]]]},{"name":"max_pooling2d_2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_2","trainable":true},"inbound_nodes":[[["leaky_re_lu_2",0,0,{}]]]},{"name":"conv2d_4","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_4","trainable":true},"inbound_nodes":[[["max_pooling2d_2",0,0,{}]]]},{"name":"leaky_re_lu_4","class_name":"LeakyReLU","config":{"alpha":0.009999999776482582,"name":"leaky_re_lu_4","trainable":true},"inbound_nodes":[[["conv2d_4",0,0,{}]]]},{"name":"max_pooling2d_3","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_3","trainable":true},"inbound_nodes":[[["leaky_re_lu_4",0,0,{}]]]},{"name":"conv2d_5","class_name":"Conv2D","config":{"filters":512,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_5","trainable":true},"inbound_nodes":[[["max_pooling2d_3",0,0,{}]]]},{"name":"batch_normalization_1","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_1","trainable":true},"inbound_nodes":[[["conv2d_5",0,0,{}]]]},{"name":"leaky_re_lu_5","class_name":"LeakyReLU","config":{"alpha":0.009999999776482582,"name":"leaky_re_lu_5","trainable":true},"inbound_nodes":[[["batch_normalization_1",0,0,{}]]]},{"name":"max_pooling2d_4","class_name":"MaxPooling2D","config":{"pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last","name":"max_pooling2d_4","trainable":true},"inbound_nodes":[[["leaky_re_lu_5",0,0,{}]]]},{"name":"conv2d_6","class_name":"Conv2D","config":{"filters":512,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_6","trainable":true},"inbound_nodes":[[["max_pooling2d_4",0,0,{}]]]},{"name":"leaky_re_lu_6","class_name":"LeakyReLU","config":{"alpha":0.009999999776482582,"name":"leaky_re_lu_6","trainable":true},"inbound_nodes":[[["conv2d_6",0,0,{}]]]},{"name":"max_pooling2d_5","class_name":"MaxPooling2D","config":{"pool_size":[1,2],"padding":"valid","strides":[1,2],"data_format":"channels_last","name":"max_pooling2d_5","trainable":true},"inbound_nodes":[[["leaky_re_lu_6",0,0,{}]]]},{"name":"reshape_1","class_name":"Reshape","config":{"target_shape":[100,512],"name":"reshape_1","trainable":true},"inbound_nodes":[[["max_pooling2d_5",0,0,{}]]]},{"name":"bidirectional","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"units":512,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":2,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm","trainable":true}},"name":"bidirectional","trainable":true},"inbound_nodes":[[["reshape_1",0,0,{}]]]},{"name":"reshape_2","class_name":"Reshape","config":{"target_shape":[100,1,1024],"name":"reshape_2","trainable":true},"inbound_nodes":[[["bidirectional",0,0,{}]]]},{"name":"conv2d_7","class_name":"Conv2D","config":{"filters":80,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_7","trainable":true},"inbound_nodes":[[["reshape_2",0,0,{}]]]},{"name":"reshape_3","class_name":"Reshape","config":{"target_shape":[100,80],"name":"reshape_3","trainable":true},"inbound_nodes":[[["conv2d_7",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["reshape_3",0,0]]},"keras_version":"tfjs-layers 1.7.4","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.4","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"conv2d/kernel","shape":[5,5,1,64],"dtype":"float32"},{"name":"conv2d/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_1/kernel","shape":[5,5,64,128],"dtype":"float32"},{"name":"conv2d_1/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_2/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"conv2d_2/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_4/kernel","shape":[3,3,128,256],"dtype":"float32"},{"name":"conv2d_4/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_5/kernel","shape":[3,3,256,512],"dtype":"float32"},{"name":"conv2d_5/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_1/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_1/beta","shape":[512],"dtype":"float32"},{"name":"conv2d_6/kernel","shape":[3,3,512,512],"dtype":"float32"},{"name":"conv2d_6/bias","shape":[512],"dtype":"float32"},{"name":"bidirectional/forward_lstm/kernel","shape":[512,2048],"dtype":"float32"},{"name":"bidirectional/forward_lstm/recurrent_kernel","shape":[512,2048],"dtype":"float32"},{"name":"bidirectional/forward_lstm/bias","shape":[2048],"dtype":"float32"},{"name":"bidirectional/backward_lstm/kernel","shape":[512,2048],"dtype":"float32"},{"name":"bidirectional/backward_lstm/recurrent_kernel","shape":[512,2048],"dtype":"float32"},{"name":"bidirectional/backward_lstm/bias","shape":[2048],"dtype":"float32"},{"name":"conv2d_7/kernel","shape":[1,1,1024,80],"dtype":"float32"},{"name":"conv2d_7/bias","shape":[80],"dtype":"float32"},{"name":"batch_normalization/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_1/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_1/moving_variance","shape":[512],"dtype":"float32"}]}]}